traceur.org
#+TITLE: Traceur
#+DATE: <2018-06-01>
* VR exercise gamified                                            :portfolio:

- *[[https://studentgames.itch.io/traceur][On Itch.io]]*

Concept of an infinite runner as a VR exercise game. I worked on this as
part of a small team for my game programming final project.

I implemented a primitive motion tracking solution based on work I had
done for a past research project. The game is able to track quick
side-to-side movements or jumping, and maps it in-game so you can avoid
obstacles approaching you. This works by calibrating offsets against the
accelerometer, and checking the magnitude of acceleration in each
direction to determine which way the player wants to dodge.
