traceur.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-06-14 Fri 00:43 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Traceur</title>
<meta name="author" content="john" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Traceur</h1>
<div id="outline-container-orgc79ca33" class="outline-2">
<h2 id="orgc79ca33">VR exercise gamified</h2>
<div class="outline-text-2" id="text-orgc79ca33">
<ul class="org-ul">
<li><b><a href="https://studentgames.itch.io/traceur">On Itch.io</a></b></li>
</ul>

<p>
Concept of an infinite runner as a VR exercise game. I worked on this as
part of a small team for my game programming final project.
</p>

<p>
I implemented a primitive motion tracking solution based on work I had
done for a past research project. The game is able to track quick
side-to-side movements or jumping, and maps it in-game so you can avoid
obstacles approaching you. This works by calibrating offsets against the
accelerometer, and checking the magnitude of acceleration in each
direction to determine which way the player wants to dodge.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2018-06-01 Fri 00:00</p>
<p class="author">Author: john</p>
<p class="date">Created: 2024-06-14 Fri 00:43</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
